GreatCowBASIC/DATFileGenerator/incfiles/p18f27q43.inc
;----- U3BRG Bits -----------------------------------------------------


;----- U3BRGH Bits -----------------------------------------------------


;----- U3FIFO Bits -----------------------------------------------------
RXBF             EQU  H'0000'
RXBE             EQU  H'0001'
XON              EQU  H'0002'
RXIDL            EQU  H'0003'
TXBF             EQU  H'0004'
TXBE             EQU  H'0005'
STPMD            EQU  H'0006'
TXWRE            EQU  H'0007'
U3RXBF           EQU  H'0000'
U3RXBE           EQU  H'0001'
U3XON            EQU  H'0002'
U3RXIDL          EQU  H'0003'
U3TXBF           EQU  H'0004'
U3TXBE           EQU  H'0005'
U3STPMD          EQU  H'0006'
U3TXWRE          EQU  H'0007'
U3RCIDL          EQU  H'0003'
RCIDL            EQU  H'0003'


;----- U3UIR Bits -----------------------------------------------------
ABDIE            EQU  H'0002'
ABDIF            EQU  H'0006'
WUIF             EQU  H'0007'
U3ABDIE          EQU  H'0002'
U3ABDIF          EQU  H'0006'
U3WUIF           EQU  H'0007'


;----- U3ERRIR Bits -----------------------------------------------------
TXCIF            EQU  H'0000'
RXFOIF           EQU  H'0001'
RXBKIF           EQU  H'0002'
FERIF            EQU  H'0003'
CERIF            EQU  H'0004'
ABDOVF           EQU  H'0005'
PERIF            EQU  H'0006'
TXMTIF           EQU  H'0007'
U3TXCIF          EQU  H'0000'
U3RXFOIF         EQU  H'0001'
U3RXBKIF         EQU  H'0002'
U3FERIF          EQU  H'0003'
U3CERIF          EQU  H'0004'
U3ABDOVF         EQU  H'0005'
U3PERIF          EQU  H'0006'
U3TXMTIF         EQU  H'0007'


;----- U3ERRIE Bits -----------------------------------------------------
TXCIE            EQU  H'0000'
RXFOIE           EQU  H'0001'
RXBKIE           EQU  H'0002'
FERIE            EQU  H'0003'
CERIE            EQU  H'0004'
ABDOVE           EQU  H'0005'
PERIE            EQU  H'0006'
TXMTIE           EQU  H'0007'
U3TXCIE          EQU  H'0000'
U3RXFOIE         EQU  H'0001'
U3RXBKIE         EQU  H'0002'
U3FERIE          EQU  H'0003'
U3CERIE          EQU  H'0004'
U3ABDOVE         EQU  H'0005'
U3PERIE          EQU  H'0006'
U3TXMTIE         EQU  H'0007'


;----- U4RXB Bits -----------------------------------------------------


;----- U4TXB Bits -----------------------------------------------------


;----- U4P2 Bits -----------------------------------------------------


;----- U4P3 Bits -----------------------------------------------------


;----- U4CON0 Bits -----------------------------------------------------
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
U4MODE0          EQU  H'0000'
U4MODE1          EQU  H'0001'
U4MODE2          EQU  H'0002'
U4MODE3          EQU  H'0003'
U4RXEN           EQU  H'0004'
U4TXEN           EQU  H'0005'
U4ABDEN          EQU  H'0006'
U4BRGS           EQU  H'0007'
U4MODE0          EQU  H'0000'
U4MODE1          EQU  H'0001'
U4MODE2          EQU  H'0002'
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
MODE3            EQU  H'0003'
RXEN             EQU  H'0004'
TXEN             EQU  H'0005'
ABDEN            EQU  H'0006'
BRGS             EQU  H'0007'


;----- U4CON2 Bits -----------------------------------------------------
FLO0             EQU  H'0000'
FLO1             EQU  H'0001'
TXPOL            EQU  H'0002'
STP0             EQU  H'0004'
STP1             EQU  H'0005'
RXPOL            EQU  H'0006'
RUNOVF           EQU  H'0007'
FLO0             EQU  H'0000'
FLO1             EQU  H'0001'
STP0             EQU  H'0004'
STP1             EQU  H'0005'
U4FLO0           EQU  H'0000'
U4FLO1           EQU  H'0001'
U4TXPOL          EQU  H'0002'
U4STP0           EQU  H'0004'
U4STP1           EQU  H'0005'
U4RXPOL          EQU  H'0006'
U4RUNOVF         EQU  H'0007'
U4FLO0           EQU  H'0000'
U4FLO1           EQU  H'0001'
U4STP0           EQU  H'0004'
U4STP1           EQU  H'0005'


;----- U4BRG Bits -----------------------------------------------------


;----- U4BRGH Bits -----------------------------------------------------


;----- U4FIFO Bits -----------------------------------------------------
RXBF             EQU  H'0000'
RXBE             EQU  H'0001'
XON              EQU  H'0002'
RXIDL            EQU  H'0003'
TXBF             EQU  H'0004'
TXBE             EQU  H'0005'
STPMD            EQU  H'0006'
TXWRE            EQU  H'0007'
U4RXBF           EQU  H'0000'
U4RXBE           EQU  H'0001'
U4XON            EQU  H'0002'
U4RXIDL          EQU  H'0003'
U4TXBF           EQU  H'0004'
U4TXBE           EQU  H'0005'
U4STPMD          EQU  H'0006'
U4TXWRE          EQU  H'0007'
U4RCIDL          EQU  H'0003'
RCIDL            EQU  H'0003'


;----- U4UIR Bits -----------------------------------------------------
ABDIE            EQU  H'0002'
ABDIF            EQU  H'0006'
WUIF             EQU  H'0007'
U4ABDIE          EQU  H'0002'
U4ABDIF          EQU  H'0006'
U4WUIF           EQU  H'0007'


;----- U4ERRIR Bits -----------------------------------------------------
TXCIF            EQU  H'0000'
RXFOIF           EQU  H'0001'
RXBKIF           EQU  H'0002'
FERIF            EQU  H'0003'
CERIF            EQU  H'0004'
ABDOVF           EQU  H'0005'
PERIF            EQU  H'0006'
TXMTIF           EQU  H'0007'
U4TXCIF          EQU  H'0000'
U4RXFOIF         EQU  H'0001'
U4RXBKIF         EQU  H'0002'
U4FERIF          EQU  H'0003'
U4CERIF          EQU  H'0004'
U4ABDOVF         EQU  H'0005'
U4PERIF          EQU  H'0006'
U4TXMTIF         EQU  H'0007'


;----- U4ERRIE Bits -----------------------------------------------------
TXCIE            EQU  H'0000'
RXFOIE           EQU  H'0001'
RXBKIE           EQU  H'0002'
FERIE            EQU  H'0003'
CERIE            EQU  H'0004'
ABDOVE           EQU  H'0005'
PERIE            EQU  H'0006'
TXMTIE           EQU  H'0007'
U4TXCIE          EQU  H'0000'
U4RXFOIE         EQU  H'0001'
U4RXBKIE         EQU  H'0002'
U4FERIE          EQU  H'0003'
U4CERIE          EQU  H'0004'
U4ABDOVE         EQU  H'0005'
U4PERIE          EQU  H'0006'
U4TXMTIE         EQU  H'0007'


;----- U5RXB Bits -----------------------------------------------------


;----- U5TXB Bits -----------------------------------------------------


;----- U5P2 Bits -----------------------------------------------------


